{
    "value":  [
                  "{\r\n    \"displayName\":  \"Windows 10 Security Baseline\",\r\n    \"IsReadOnly\":  false,\r\n    \"IsFixedSize\":  false,\r\n    \"IsSynchronized\":  false,\r\n    \"Keys\":  [\r\n                 \"roleScopeTagIds\",\r\n                 \"settingsDelta\",\r\n                 \"description\",\r\n                 \"displayName\"\r\n             ],\r\n    \"Values\":  [\r\n                   [\r\n                       \"0\"\r\n                   ],\r\n                   [\r\n                       {\r\n                           \"id\":  \"629290cb-b7bc-4818-aae9-c9f56e2cace4\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_lockScreenActivateAppsWithVoice\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"de46ccc2-ad69-484c-ba5c-1581e8a174da\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_lockScreenBlockToastNotifications\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"77155761-3b8b-45d2-aa18-15be26c9eee6\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"successAndFailure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_accountLogonAuditCredentialValidation\",\r\n                           \"value\":  \"successAndFailure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"a4be5143-786f-4d4e-9093-82da56dac7bf\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"none\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_accountLogonAuditKerberosAuthenticationService\",\r\n                           \"value\":  \"none\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"3e046453-324a-4f26-a298-9bc1b98c8cc2\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"failure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditAccountLockout\",\r\n                           \"value\":  \"failure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"94753979-ec72-4489-a4a7-3dad5019013c\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"success\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditGroupMembership\",\r\n                           \"value\":  \"success\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"2c993617-32e9-4dcf-b4ac-52fbf2d2bf9d\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"successAndFailure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditLogon\",\r\n                           \"value\":  \"successAndFailure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"ebc85030-2833-4b77-9e2b-8a86266cac0f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"successAndFailure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditOtherLogonLogoffEvents\",\r\n                           \"value\":  \"successAndFailure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"d692b954-63c8-4d99-bd52-4f87b984bc1e\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"success\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_accountLogonLogoffAuditSpecialLogon\",\r\n                           \"value\":  \"success\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"f3cd9ce7-035e-404a-9ed6-9025c830de7d\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"success\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_accountManagementAuditSecurityGroupManagement\",\r\n                           \"value\":  \"success\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"f9458885-bbc4-442f-80bd-a6c65149a331\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"successAndFailure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_accountManagementAuditUserAccountManagement\",\r\n                           \"value\":  \"successAndFailure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"d5e6788a-5ba1-437c-a59c-e17365c93ba4\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"success\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_detailedTrackingAuditPNPActivity\",\r\n                           \"value\":  \"success\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"54eb6a52-c176-4a14-ae81-84372f6f9def\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"success\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_detailedTrackingAuditProcessCreation\",\r\n                           \"value\":  \"success\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"095e55db-fe31-4c13-87a1-b7ba8b345d79\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"failure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditDetailedFileShare\",\r\n                           \"value\":  \"failure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"6b11c959-3751-4493-8572-9858ec6884e4\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"successAndFailure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditFileShare\",\r\n                           \"value\":  \"successAndFailure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"22998285-ab92-4d73-a49b-660e068e82c0\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"successAndFailure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditOtherObjectAccessEvents\",\r\n                           \"value\":  \"successAndFailure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"78b94c43-1cb6-4913-bf97-8cf7ef4a2efc\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"successAndFailure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_objectAccessAuditRemovableStorage\",\r\n                           \"value\":  \"successAndFailure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"701bc6d7-c259-4d53-a7b5-831d84ba4b74\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"success\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditAuthenticationPolicyChange\",\r\n                           \"value\":  \"success\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"6ca76297-466b-4d04-af50-f0a9134f690a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"successAndFailure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditMPSSVCRuleLevelPolicyChange\",\r\n                           \"value\":  \"successAndFailure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"e0b68cfb-66b4-4cd2-95a4-3fb72bce0108\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"failure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditOtherPolicyChangeEvents\",\r\n                           \"value\":  \"failure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"bb2ebf42-3365-4c3c-aec2-1ad57c98c9d2\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"success\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_policyChangeAuditPolicyChange\",\r\n                           \"value\":  \"success\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"16c571f6-8164-423c-b7ae-3c02e8d346a8\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"successAndFailure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_privilegeUseAuditSensitivePrivilegeUse\",\r\n                           \"value\":  \"successAndFailure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"a6550973-6898-4bcb-9135-2a171ef69bce\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"successAndFailure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_systemAuditOtherSystemEvents\",\r\n                           \"value\":  \"successAndFailure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"b6508a79-2c8a-425d-b328-ede73b77fa15\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"success\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_systemAuditSecurityStateChange\",\r\n                           \"value\":  \"success\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"10bf20c9-8ee4-402a-8889-143ea8d0e093\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"success\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_systemAuditSecuritySystemExtension\",\r\n                           \"value\":  \"success\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"cbae6eda-c4ad-45c3-af2b-061278358cda\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"successAndFailure\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_systemAuditSystemIntegrity\",\r\n                           \"value\":  \"successAndFailure\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"687fa49d-ed63-4bc7-b469-a7e7315ec87f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"withoutDMA\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardSecureBootWithDMA\",\r\n                           \"value\":  \"withoutDMA\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"3427d6d7-611f-41e0-9d4d-8757fddfd74f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardEnableVirtualizationBasedSecurity\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"225656f6-cba6-4fbf-a275-dafbdce55a14\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLaunchSystemGuard\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"91df0f36-a75a-4055-a72f-7543c1d14fb1\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enableWithUEFILock\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings\",\r\n                           \"value\":  \"enableWithUEFILock\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"75093aa9-2c9c-43af-8c9a-7687b52bb8d1\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_appManagementMSIAlwaysInstallWithElevatedPrivileges\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"2c2e9e8e-3d19-4469-9ffc-336f1b851c05\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_appManagementMSIAllowUserControlOverInstall\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"a1d20e76-cba4-4494-a962-592a67eda6d1\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_gameDvrBlocked\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"2d0b8b59-3199-4379-850c-f58eeae30861\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAdobeReaderLaunchChildProcess\",\r\n                           \"value\":  \"notConfigured\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"779ec03d-42a1-4e16-8781-47405ff41fb1\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeCommunicationAppsLaunchChildProcess\",\r\n                           \"value\":  \"notConfigured\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"32454c44-63a3-475a-8305-c96a486df2fb\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n                           \"valueJson\":  \"4\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderSignatureUpdateIntervalInHours\",\r\n                           \"value\":  4\r\n                       },\r\n                       {\r\n                           \"id\":  \"378fb0e1-f8e9-458f-9b5d-410e6668ca5d\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"quick\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderScanType\",\r\n                           \"value\":  \"quick\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"678111db-0515-43ef-ba2a-6e973a24bc3b\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"everyday\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderScheduleScanDay\",\r\n                           \"value\":  \"everyday\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"d513c9dd-5c75-42a3-82a3-f8f45fcd5052\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderScheduledScanTime\",\r\n                           \"value\":  \"notConfigured\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"81d51f4b-9ad9-4e86-b706-275f0046cec1\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderCloudBlockLevel\",\r\n                           \"value\":  \"notConfigured\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"31bcd7a6-3f86-488a-bc61-a725d9e03ba8\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"false\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderScanNetworkFiles\",\r\n                           \"value\":  false\r\n                       },\r\n                       {\r\n                           \"id\":  \"7df3592f-94c9-4e7a-bbda-374cfd07959b\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"false\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderRequireRealTimeMonitoring\",\r\n                           \"value\":  false\r\n                       },\r\n                       {\r\n                           \"id\":  \"66524c3a-f740-41f8-a4a5-1063b6c1cf94\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"null\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_defenderAllowScanScriptsLoadedInInternetExplorer\",\r\n                           \"value\":  null\r\n                       },\r\n                       {\r\n                           \"id\":  \"b0fcfa3d-4edc-4fda-a735-5ac54dd98091\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"false\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderScanArchiveFiles\",\r\n                           \"value\":  false\r\n                       },\r\n                       {\r\n                           \"id\":  \"0cf6a320-34c9-4385-92c4-894a20a4867d\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"false\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderRequireBehaviorMonitoring\",\r\n                           \"value\":  false\r\n                       },\r\n                       {\r\n                           \"id\":  \"2bc6ee86-4dd5-43fd-9382-1f0bd12293a4\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"false\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderRequireCloudProtection\",\r\n                           \"value\":  false\r\n                       },\r\n                       {\r\n                           \"id\":  \"8093cddf-9487-4e40-985e-03112dda361e\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"false\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderScanIncomingMail\",\r\n                           \"value\":  false\r\n                       },\r\n                       {\r\n                           \"id\":  \"d8a768b9-33eb-442b-90e0-147f48c98597\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"false\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderScanRemovableDrivesDuringFullScan\",\r\n                           \"value\":  false\r\n                       },\r\n                       {\r\n                           \"id\":  \"2e690c0c-9147-4a2b-930c-c77adfa9bf11\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"userDefined\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsOtherProcessInjectionType\",\r\n                           \"value\":  \"userDefined\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"235590c4-291f-44ad-a303-3c67789fa00a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"userDefined\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsExecutableContentCreationOrLaunchType\",\r\n                           \"value\":  \"userDefined\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"b6ba66ad-91ef-436f-b60d-23b541b77dfb\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"userDefined\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeAppsLaunchChildProcessType\",\r\n                           \"value\":  \"userDefined\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"4fb8705d-f5b6-4411-9e10-f50ae4710f76\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"userDefined\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_defenderOfficeMacroCodeAllowWin32ImportsType\",\r\n                           \"value\":  \"userDefined\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"1eb30db1-53e0-4d0f-838c-abad22940753\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"userDefined\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptObfuscatedMacroCodeType\",\r\n                           \"value\":  \"userDefined\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"c7bb3ad0-dfcd-41c0-8791-e1af601ba941\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"userDefined\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_defenderScriptDownloadedPayloadExecutionType\",\r\n                           \"value\":  \"userDefined\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"22939f7a-712f-4a7e-9566-9448fa0a269f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"userDefined\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_defenderEmailContentExecutionType\",\r\n                           \"value\":  \"userDefined\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"80f63be2-d62d-4406-8033-f7d88c537948\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_defenderPreventCredentialStealingType\",\r\n                           \"value\":  \"notConfigured\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"97d710ea-b56a-4292-a7e9-e77ff3f30c67\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"block\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderPotentiallyUnwantedAppAction\",\r\n                           \"value\":  \"block\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"5952c9a8-7192-4370-8a7e-fa78f7853cbd\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"userDefined\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_defenderUntrustedUSBProcessType\",\r\n                           \"value\":  \"userDefined\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"9c5c464b-d7da-4ece-be2b-cb2863c84d43\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"notConfigured\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_defenderNetworkProtectionType\",\r\n                           \"value\":  \"notConfigured\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"31963621-c35c-4dab-a2f4-335e75b350ec\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"sendSafeSamplesAutomatically\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_defenderSubmitSamplesConsentType\",\r\n                           \"value\":  \"sendSafeSamplesAutomatically\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"955c1e25-df5b-4b4f-a02c-2ae1d53b6ed4\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenEnableInShell\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"10e17c92-8029-4eb7-9313-87edfc44b46a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenBlockOverrideForFiles\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"8e4f7c92-8760-4aba-a448-6417e370ee8e\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementAbstractComplexSettingInstance\",\r\n                           \"implementationId\":  \"deviceConfiguration--hardenedUncPathEnabled\",\r\n                           \"valueJson\":  \"{\\\"$implementationId\\\":\\\"deviceConfiguration--hardenedUncPathEnabled\\\",\\\"hardenedUncPaths\\\":[{\\\"serverPath\\\":\\\"\\\\\\\\\\\\\\\\*\\\\\\\\SYSVOL\\\",\\\"securityFlags\\\":[\\\"requireMutualAuthentication\\\",\\\"requireIntegrity\\\"]},{\\\"serverPath\\\":\\\"\\\\\\\\\\\\\\\\*\\\\\\\\NETLOGON\\\",\\\"securityFlags\\\":[\\\"requireMutualAuthentication\\\",\\\"requireIntegrity\\\"]}]}\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityHardenedUncPaths\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"b56fe790-6a77-4ee5-81fe-461da2525402\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityDownloadingOfPrintDriversOverHttp\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"cbe83aaf-09d3-40c6-a797-5629f474e296\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_connectivityInternetDownloadForWebPublishingAndOnlineOrderingWizards\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"efa478ee-e7fc-4c1a-92d7-6c91b4c9ec21\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementCollectionSettingInstance\",\r\n                           \"valueJson\":  \"[\\\"tls11\\\",\\\"tls12\\\"]\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerEncryptionSupport\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"5f2e7a90-324e-486d-b63d-eb1856b76e06\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerPreventManagingSmartScreenFilter\",\r\n                           \"value\":  \"enable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"88fab870-76da-42ee-8bba-614b25b5dc36\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptActiveXControlsMarkedSafeForScripting\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"88460536-8439-4826-9dd9-0eb58e3444d0\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneFileDownloads\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"00512ceb-6cb1-43f5-a0ab-daba0ed5525b\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerCertificateAddressMismatchWarning\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"aa53989e-0133-4f80-8b62-afc4e5b11c0e\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerEnhancedProtectedMode\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"fd31eafd-cafa-4d28-b0e6-0fbbf333f64d\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"noSites\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerFallbackToSsl3\",\r\n                           \"value\":  \"noSites\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"a86ee015-2c0a-4ec3-bf5e-3b15c49490b2\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerSoftwareWhenSignatureIsInvalid\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"c2e811bd-2f58-4c6c-8f34-8a7cd53934ef\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerCheckServerCertificateRevocation\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"d402813f-5d6c-4999-ae99-6f240ad307da\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerCheckSignaturesOnDownloadedPrograms\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"657e059e-e9cf-4480-bcf4-01896ceb1734\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesConsistentMimeHandling\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"7eb3dff2-f5ad-4f28-ae41-a89fbe95c765\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerBypassSmartScreenWarnings\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"ccc8e836-9fc5-4b9d-ba26-24496b6ffa66\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerBypassSmartScreenWarningsAboutUncommonFiles\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"7467b15c-5d2c-45bd-b5a9-4495b275743f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerCrashDetection\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"cc0dd7cb-c301-4d74-b6f1-adfb6d633310\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerDownloadEnclosures\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"1ce30f32-fe26-4d43-bec4-c2830950cdc4\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerIgnoreCertificateErrors\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"4b27d99f-92d0-47dd-8f4f-534f644c5cc6\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerDisableProcessesInEnhancedProtectedMode\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"876291d2-1aa8-41e8-805b-b9ab24f6caa4\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerSecuritySettingsCheck\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"82211ce2-81c5-472f-a71a-257f0dca372b\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerActiveXControlsInProtectedMode\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"4441fed0-83d4-456e-b533-3c19561e0002\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerUsersAddingSites\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"0ec1974e-1ec1-40e8-8636-2e7ec8cc0cbb\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerUsersChangingPolicies\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"edc6756d-3af6-4b57-9bff-f9969887b68f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerBlockOutdatedActiveXControls\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"8ca0a8a0-f2bc-461f-9f46-3d82d1650085\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerIncludeAllNetworkPaths\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"ad27df52-a163-406d-9b6b-c3cf50698630\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAccessToDataSources\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"7106f863-0c3e-4e8b-9b4a-1f00e14dca57\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAutomaticPromptForFileDownloads\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"812f543c-950a-4691-ab03-ec10cceb44ea\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneCopyAndPasteViaScript\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"a48da4b9-9b1f-4a44-b292-94d86128786b\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragAndDropOrCopyAndPasteFiles\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"0b7b7789-e593-4fe6-9f71-7f09f3891da3\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLessPrivilegedSites\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"767a23b2-690e-40e6-b835-2490594165f3\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLoadingOfXamlFiles\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"76d406a5-2bb2-4ff8-a88e-a9f0380db3f3\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDotNetFrameworkReliantComponents\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"5427667e-977e-42b9-bffe-bdfa4424c003\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowOnlyApprovedDomainsToUseActiveXControls\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"dcd96708-6387-4401-9ee0-798ddcb022ac\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowOnlyApprovedDomainsToUseTdcActiveXControls\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"01aa7a06-2609-4922-91af-7984ad1ab654\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptingOfWebBrowserControls\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"a1d2d06f-6c81-4c1a-a93e-75d9c4a7c6f7\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptInitiatedWindows\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"659afe12-c67d-4571-ab54-9e7328a8a3d0\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneScriptlets\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"e4e26b34-3179-4220-979e-6413638ee651\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneSmartScreen\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"99160515-de39-419e-a4ad-cba4e7d26a05\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneUpdatesToStatusBarViaScript\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"bdb02804-bee8-4da1-b310-421ae2fb74de\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneUserDataPersistence\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"979c7650-69de-4fe6-ad0c-4ffa34955b9f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneAllowVBScriptToRun\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"04b497dc-88d4-460b-ba7b-1e81ab791817\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDoNotRunAntimalwareAgainstActiveXControls\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"a7b6f797-3bd4-43fe-ace0-58449a656896\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDownloadSignedActiveXControls\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"5dda667a-76d9-4bdb-8c7b-e0b9b0950a9d\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDownloadUnsignedActiveXControls\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"2ddfcc7c-0c5a-467a-95d4-90576ffbf19f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneCrossSiteScriptingFilter\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"825c47cb-f41c-46be-90eb-200e9049cbd2\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragContentFromDifferentDomainsAcrossWindows\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"e45ef0f4-ff44-450c-8e9c-3fd81cf8193b\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneDragContentFromDifferentDomainsWithinWindows\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"85a5c881-2539-4a7e-8a07-348b3e82c74a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneProtectedMode\",\r\n                           \"value\":  \"enable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"9a4b3b6f-0df6-4e17-a732-699ec94866a1\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneIncludeLocalPathWhenUploadingFilesToServer\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"8f5c03b2-6c2e-4107-82bb-5bb6535a9f3a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"74e3200e-66f5-481a-8bb6-ec293a632e62\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disableJava\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneJavaPermissions\",\r\n                           \"value\":  \"disableJava\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"cd539368-1b6e-4b29-bb65-9dd290026f0c\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLaunchApplicationsAndFilesInAnIFrame\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"da9396cc-f518-4bb8-9551-5179fcd0e3d6\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"prompt\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneLogonOptions\",\r\n                           \"value\":  \"prompt\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"8da30d97-9ae6-41ee-aca2-637ac9c9e002\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneNavigateWindowsAndFramesAcrossDifferentDomains\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"6bd8d751-b47d-4748-a069-6c9f391f1b43\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneRunDotNetFrameworkReliantComponentsSignedWithAuthenticode\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"ee5a8365-9d8d-4ac3-9fec-29f36e8796c4\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"prompt\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZoneSecurityWarningForPotentiallyUnsafeFiles\",\r\n                           \"value\":  \"prompt\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"312b08c0-f8c3-40cd-8108-0400b52b766a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerInternetZonePopupBlocker\",\r\n                           \"value\":  \"enable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"c519f3ab-2a18-41f5-b0f1-aae5b5d0e1d8\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneDoNotRunAntimalwareAgainstActiveXControls\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"11093fd0-4150-440d-b840-519a21e3c7bf\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"d1a8ef63-3def-42e9-bc2e-56eecb2203c6\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"highSafety\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerIntranetZoneJavaPermissions\",\r\n                           \"value\":  \"highSafety\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"79f1c5be-cc80-414f-9974-4c7513c64b81\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerLocalMachineZoneDoNotRunAntimalwareAgainstActiveXControls\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"61bf9056-faf2-41aa-8324-56ac6c66029d\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disableJava\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerLocalMachineZoneJavaPermissions\",\r\n                           \"value\":  \"disableJava\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"551aa6a2-1642-4a27-baa6-451a334d9006\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownInternetZoneSmartScreen\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"535d057c-bcc6-43b1-942c-e947edf6768a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disableJava\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownIntranetZoneJavaPermissions\",\r\n                           \"value\":  \"disableJava\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"20639261-9b16-4a46-9415-e5f7cc72a5c3\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disableJava\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownLocalMachineZoneJavaPermissions\",\r\n                           \"value\":  \"disableJava\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"d20338e0-539a-40c0-bdc8-cf1fd6139c2d\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownRestrictedZoneSmartScreen\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"4284d114-a155-4f0c-9264-303b5c436368\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disableJava\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownRestrictedZoneJavaPermissions\",\r\n                           \"value\":  \"disableJava\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"bba58d45-a79c-4f82-a1e0-da8859c4f77c\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disableJava\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerLockedDownTrustedZoneJavaPermissions\",\r\n                           \"value\":  \"disableJava\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"8b6c8c21-b221-4089-8ce7-ca74d655ed7a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesMimeSniffingSafetyFeature\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"7cc08dc7-1776-4cb8-a4eb-c03254225c9f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesMKProtocolSecurityRestriction\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"da70fa0c-47c0-48c4-846f-69c0754a225a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesNotificationBar\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"5cb99511-a5bd-409b-9a70-92b91e615d40\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerPreventPerUserInstallationOfActiveXControls\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"0e4af835-8e95-4eef-bad8-010530e087bc\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesProtectionFromZoneElevation\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"d8d276bf-e90b-40d7-a6e8-eca2486e4723\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRemoveRunThisTimeButtonForOutdatedActiveXControls\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"3d20b04d-2f63-4e0d-977e-cf0ec4347da9\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesRestrictActiveXInstall\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"39e6c517-f876-4697-a861-a6b40906ff26\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAccessToDataSources\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"2658414d-8434-4e8c-87ba-15d11a40c76a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneActiveScripting\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"d9d9e34b-5f2e-4c25-92ac-d994e6f38cb1\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAutomaticPromptForFileDownloads\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"85f3d3d8-4eed-40d2-b0af-c9d2eee8890f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneBinaryAndScriptBehaviors\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"1ba683b1-65a2-421f-a040-64a6c2b03d18\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneCopyAndPasteViaScript\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"1ff36da1-508c-4825-9f8d-88ec3186d34a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragAndDropOrCopyAndPasteFiles\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"4bee1009-c5b9-497c-add6-acb8387de302\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLessPrivilegedSites\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"771db015-2257-48f6-83c3-863afaa34a65\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLoadingOfXamlFiles\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"847a3f03-ca34-4b09-9531-33befe48f5d1\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneMetaRefresh\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"b2856ff8-5774-4ab8-b506-34b5e94dac72\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDotNetFrameworkReliantComponents\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"6086a26f-6d08-405d-a9b2-f9d26b436db5\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowOnlyApprovedDomainsToUseActiveXControls\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"5fdbc3ab-6b1c-48bb-9fbe-d3a684ece13f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowOnlyApprovedDomainsToUseTdcActiveXControls\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"cc5a5fbc-560e-488e-8d7a-26bc01150893\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptingOfWebBrowserControls\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"e64375e7-ad30-4732-9891-122250fbdf60\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptInitiatedWindows\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"d4253d7e-d21f-4e2b-9e80-875ed12e45a4\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptlets\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"ce6526f8-a3cc-4b73-98ae-fa857e600e63\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneSmartScreen\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"d8cedb9e-1d70-4741-90de-f9e4fa8bd338\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneUpdatesToStatusBarViaScript\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"7dc14a0a-5637-46d3-9c69-769ed6f564f0\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneUserDataPersistence\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"ed66ee55-ec3e-41ea-8bac-5043ae615c45\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneAllowVBScriptToRun\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"3ea71d83-2a94-419a-bfed-ef3372aed12e\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDoNotRunAntimalwareAgainstActiveXControls\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"f7bbc838-c368-4967-a7b5-23a9c026e759\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDownloadSignedActiveXControls\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"0b00b201-f5e3-4935-8605-f1caca380766\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDownloadUnsignedActiveXControls\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"bbceb971-e46c-45a8-88ca-52455b56ccb6\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneCrossSiteScriptingFilter\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"ac162128-1eeb-42c2-9e14-7465ecdd53a6\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragContentFromDifferentDomainsAcrossWindows\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"7e4425d1-6c3c-4221-a08c-f8e1480e9167\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneDragContentFromDifferentDomainsWithinWindows\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"d62981a1-5edd-4041-97eb-8c9f94bb28d0\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneIncludeLocalPathWhenUploadingFilesToServer\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"d1205111-4b27-4194-92df-9fcb27bb2163\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"b2584f6d-b5f6-4282-aec5-12de7ec73788\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disableJava\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneJavaPermissions\",\r\n                           \"value\":  \"disableJava\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"54bd91e9-c5f4-45b3-b1f0-2126b94ff29a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLaunchApplicationsAndFilesInAnIFrame\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"72f75c55-06b0-4dff-811f-849d0b7996e2\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"anonymous\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneLogonOptions\",\r\n                           \"value\":  \"anonymous\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"4d6d5cee-396e-4ba3-9f80-45f8dbdadc90\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneNavigateWindowsAndFramesAcrossDifferentDomains\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"bb60ffb1-6f77-4a27-b9a3-ef33c021e6bf\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneRunActiveXControlsAndPlugins\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"4c581aaa-4180-426a-919b-e2054cc06beb\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneRunDotNetFrameworkReliantComponentsSignedWithAuthenticode\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"2e6ad222-0a53-4964-87c4-c973bafc7003\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneScriptingOfJavaApplets\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"0613d057-826a-4d05-85a9-23420ea3b4c4\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneSecurityWarningForPotentiallyUnsafeFiles\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"f5e70e2d-297e-4787-80d7-149943db8743\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZoneProtectedMode\",\r\n                           \"value\":  \"enable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"2b768c7a-aca5-4cc0-863b-de8a2dddabe9\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerRestrictedZonePopupBlocker\",\r\n                           \"value\":  \"enable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"9011db90-31a3-43b3-bdbf-e7d025c235bd\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesRestrictFileDownload\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"b4955663-e54d-49d9-8f3a-5067bd931e45\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerProcessesScriptedWindowSecurityRestrictions\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"7e3a0784-754d-41f4-b00b-53da9dd689d6\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerSecurityZonesUseOnlyMachineSettings\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"046386c1-58d6-44b2-8b4f-f88d3831ad73\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerUseActiveXInstallerService\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"d943d747-b6e0-41d9-ad38-62a37f76f518\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneDoNotRunAntimalwareAgainstActiveXControls\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"02ab9ccb-4295-4757-8ae4-172fe31dfb3e\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disable\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneInitializeAndScriptActiveXControlsNotMarkedAsSafe\",\r\n                           \"value\":  \"disable\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"455783f8-8d1e-4fe7-882b-c046385a62cc\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"highSafety\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerTrustedZoneJavaPermissions\",\r\n                           \"value\":  \"highSafety\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"ea892b27-690f-41e7-9ae5-ddb9d4616766\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetExplorerAutoComplete\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"38dbaeb3-2300-4ba6-9481-ccba62e377aa\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"blockAll\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_dmaGuardDeviceEnumerationPolicy\",\r\n                           \"value\":  \"blockAll\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"77cb4ca3-39fa-4b5f-b37d-9c7dfe47b4bf\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementAbstractComplexSettingInstance\",\r\n                           \"implementationId\":  \"deviceConfiguration--remoteAssistanceSolicitedSettingDisabled\",\r\n                           \"valueJson\":  \"{\\\"$implementationId\\\":\\\"deviceConfiguration--remoteAssistanceSolicitedSettingDisabled\\\"}\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_remoteAssistanceSolicitedSetting\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"495a31c2-11c8-4d9d-86aa-c65da656dffb\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementAbstractComplexSettingInstance\",\r\n                           \"implementationId\":  \"deviceConfiguration--hardwareDeviceInstallationBlocked\",\r\n                           \"valueJson\":  \"{\\\"$implementationId\\\":\\\"deviceConfiguration--hardwareDeviceInstallationBlocked\\\",\\\"removeMatchingHardwareDevices\\\":true,\\\"identifiers\\\":[\\\"{d48179be-ec20-11d1-b6b8-00c04fa372a7}\\\"]}\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_hardwareDeviceInstallationBySetupClasses\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"b5594b92-f4c2-434f-94ff-013df84983c7\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementComplexSettingInstance\",\r\n                           \"valueJson\":  \"{\\\"inboundConnectionsBlocked\\\":true,\\\"outboundConnectionsRequired\\\":true,\\\"inboundNotificationsBlocked\\\":true,\\\"firewallEnabled\\\":\\\"allowed\\\"}\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfileDomain\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"88643800-a96f-4184-af13-d35754237514\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementComplexSettingInstance\",\r\n                           \"valueJson\":  \"{\\\"inboundConnectionsBlocked\\\":true,\\\"outboundConnectionsRequired\\\":true,\\\"inboundNotificationsBlocked\\\":true,\\\"firewallEnabled\\\":\\\"allowed\\\"}\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePrivate\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"7e749cac-ea0e-43c3-9613-687c6fa5f260\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementComplexSettingInstance\",\r\n                           \"valueJson\":  \"{\\\"connectionSecurityRulesFromGroupPolicyNotMerged\\\":true,\\\"policyRulesFromGroupPolicyNotMerged\\\":true,\\\"inboundConnectionsBlocked\\\":true,\\\"outboundConnectionsRequired\\\":true,\\\"inboundNotificationsBlocked\\\":true,\\\"firewallEnabled\\\":\\\"allowed\\\"}\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_firewallProfilePublic\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"5f2d3a0d-81b5-4c15-92d9-50b754e830af\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementComplexSettingInstance\",\r\n                           \"valueJson\":  \"{\\\"requireEncryptionForWriteAccess\\\":false}\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_bitLockerRemovableDrivePolicy\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"b2ce8415-c4ce-4113-81f5-30663f3d1d5b\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_searchDisableIndexingEncryptedItems\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"c07109c1-fab7-4b8e-8b6c-0815bcc10fd3\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_passwordRequired\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"107e3904-c19e-44f8-9437-47f93b58ada6\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"alphanumeric\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_passwordRequiredType\",\r\n                           \"value\":  \"alphanumeric\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"a303032e-52ea-4948-afb3-c2c7cdeebe3b\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n                           \"valueJson\":  \"60\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_passwordExpirationDays\",\r\n                           \"value\":  60\r\n                       },\r\n                       {\r\n                           \"id\":  \"544498d4-7d74-4ddf-8e77-7cec9df7f0e0\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n                           \"valueJson\":  \"3\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_passwordMinimumCharacterSetCount\",\r\n                           \"value\":  3\r\n                       },\r\n                       {\r\n                           \"id\":  \"a80eb92b-ad0a-4bca-884f-bda99746bb76\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n                           \"valueJson\":  \"24\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_passwordPreviousPasswordBlockCount\",\r\n                           \"value\":  24\r\n                       },\r\n                       {\r\n                           \"id\":  \"6cdcca60-23ff-4139-9ed7-36abbee72028\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n                           \"valueJson\":  \"8\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_passwordMinimumLength\",\r\n                           \"value\":  8\r\n                       },\r\n                       {\r\n                           \"id\":  \"96f0400d-b464-4227-b00c-9318f558b224\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n                           \"valueJson\":  \"10\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_passwordSignInFailureCountBeforeFactoryReset\",\r\n                           \"value\":  10\r\n                       },\r\n                       {\r\n                           \"id\":  \"3c726ea4-0bd3-4375-83dc-7732738c803c\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n                           \"valueJson\":  \"1\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_passwordMinimumAgeInDays\",\r\n                           \"value\":  1\r\n                       },\r\n                       {\r\n                           \"id\":  \"dea64933-2a16-4825-bb83-0db8130d7932\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_passwordBlockSimple\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"05e90fb0-5377-46fd-9e17-4e339216db19\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_lockScreenCamera\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"3b8b9098-8bce-4472-88cd-1be93a5aaf37\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_lockScreenSlideShow\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"30e9fb1e-7c4e-4001-baa0-10c3162593a9\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_inkWorkspaceAccess\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"f86ddb94-e50d-4607-bff4-f494849c6b61\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_powerShellShellScriptBlockLogging\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"42d52ac4-aa74-47b4-812d-de7de9622cae\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_appsMicrosoftAccountsOptional\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"cae95cb2-9c9c-4a80-801f-328506380d56\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"doNotExecute\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_autoPlayDefaultAutoRunBehavior\",\r\n                           \"value\":  \"doNotExecute\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"8d0c2bee-562f-41b7-ae6f-aeaed571b34f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_autoPlayMode\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"082c880f-5c7d-4351-8ec6-19c4a44d0e0d\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_autoPlayForNonVolumeDevices\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"45fbd49e-b5c6-46c7-a9e4-2fac894d2163\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_edgeBlockPasswordManager\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"7607b619-f105-422e-bfe8-3534d6396fc7\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_edgeRequireSmartScreen\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"14a1adc9-a8fd-4b41-a913-9e25ea411792\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_smartScreenBlockPromptOverride\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"048b1b4b-a154-4d9f-a154-0c20e69c82da\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_smartScreenBlockPromptOverrideForFiles\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"550a9133-52a9-4e16-b29f-312676f76958\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_edgePreventCertificateErrorOverride\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"b17b0b1c-3451-42f8-8441-876ac4765acd\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_remoteHostDelegationOfNonExportableCredentials\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"ef052dc7-334d-44eb-9861-bbc72d64fd3d\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_credentialsUIEnumerateAdministrators\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"dabf8d48-3979-4695-99e2-f4136b307f46\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_dataProtectionBlockDirectMemoryAccess\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"bc19b7fa-d35a-41fc-8166-b88c946af4ee\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n                           \"valueJson\":  \"32768\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceApplicationLogMaximumFileSizeInKb\",\r\n                           \"value\":  32768\r\n                       },\r\n                       {\r\n                           \"id\":  \"527b784e-2edc-4b04-ba85-d47eb7934113\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n                           \"valueJson\":  \"32768\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceSystemLogMaximumFileSizeInKb\",\r\n                           \"value\":  32768\r\n                       },\r\n                       {\r\n                           \"id\":  \"03d13271-0d53-4efa-bc02-475bc7454638\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n                           \"valueJson\":  \"196608\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_eventLogServiceSecurityLogMaximumFileSizeInKb\",\r\n                           \"value\":  196608\r\n                       },\r\n                       {\r\n                           \"id\":  \"107df8c5-6940-4bf0-93a3-12e3a1a7c5e6\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"false\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlocked\",\r\n                           \"value\":  false\r\n                       },\r\n                       {\r\n                           \"id\":  \"14555c25-b1b0-4db8-ad5e-ed5ad1fee87e\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"false\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockThirdPartyNotifications\",\r\n                           \"value\":  false\r\n                       },\r\n                       {\r\n                           \"id\":  \"9012852b-6772-4ab2-8c18-ab703c934624\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"false\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_windowsSpotlightBlockConsumerSpecificFeatures\",\r\n                           \"value\":  false\r\n                       },\r\n                       {\r\n                           \"id\":  \"5e385bf8-b825-4482-88b6-29f456571a6e\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_explorerDataExecutionPrevention\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"68862696-0de8-473f-b12b-04094b05a569\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_explorerHeapTerminationOnCorruption\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"b368e64b-db67-4124-8509-e64affe095ad\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsBlockRemoteLogonWithBlankPassword\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"ad0799e9-d56d-4284-bb99-164eac49cc86\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementIntegerSettingInstance\",\r\n                           \"valueJson\":  \"15\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMachineInactivityLimit\",\r\n                           \"value\":  15\r\n                       },\r\n                       {\r\n                           \"id\":  \"8c10c3c9-519a-49fd-9524-1019aea8cee4\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"lockWorkstation\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsSmartCardRemovalBehavior\",\r\n                           \"value\":  \"lockWorkstation\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"87ad1282-e2e0-45ec-b5af-15b2c63dc072\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsClientDigitallySignCommunicationsAlways\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"b8ba7089-bd3c-445c-9615-2e5bc17af120\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsClientSendUnencryptedPasswordToThirdPartySMBServers\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"fd71c2f9-df2b-4b0a-8e55-64142e79009a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDisableServerDigitallySignCommunicationsAlways\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"100bf586-d9dc-4bff-b8f5-b839d8c2eacf\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDoNotAllowAnonymousEnumerationOfSAMAccounts\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"19bb10e1-98ba-44b7-a554-9c9c2d89f5be\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowAnonymousEnumerationOfSAMAccountsAndShares\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"946c514a-7b4b-4c00-8640-f2cd075250e4\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsRestrictAnonymousAccessToNamedPipesAndShares\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"23e3e86e-5606-4d9c-9fff-b41677f6bb83\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"O:BAG:BAD:(A;;RC;;;BA)\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowRemoteCallsToSecurityAccountsManager\",\r\n                           \"value\":  \"O:BAG:BAD:(A;;RC;;;BA)\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"2ef604af-80aa-4cfb-a4e5-66ebfadc4383\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDoNotStoreLANManagerHashValueOnNextPasswordChange\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"0fcc590a-9a74-4ba0-95f4-fc0d635894ba\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"lmNtlmV2AndNotLmOrNtm\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_lanManagerAuthenticationLevel\",\r\n                           \"value\":  \"lmNtlmV2AndNotLmOrNtm\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"269d0d87-9596-43ac-ae9b-e5a5f0b43a6e\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"ntlmV2And128BitEncryption\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients\",\r\n                           \"value\":  \"ntlmV2And128BitEncryption\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"c7b13a7b-47ad-4bda-b7fe-d184dc5dc8bc\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"ntlmV2And128BitEncryption\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers\",\r\n                           \"value\":  \"ntlmV2And128BitEncryption\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"850eef79-cdb1-4ebe-86dc-73bba7a48d57\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"promptForConsentOnTheSecureDesktop\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAdministratorElevationPromptBehavior\",\r\n                           \"value\":  \"promptForConsentOnTheSecureDesktop\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"93088038-62d3-4d23-9b73-ff1841cd398c\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"automaticallyDenyElevationRequests\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsStandardUserElevationPromptBehavior\",\r\n                           \"value\":  \"automaticallyDenyElevationRequests\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"bedf0fa7-b637-4e6b-8ed7-41445ba0aa87\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsDetectApplicationInstallationsAndPromptForElevation\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"d522e143-f96a-4a12-a226-28f4cea01198\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsAllowUIAccessApplicationsForSecureLocations\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"5b8770f5-5c7a-48ef-ba39-a0f1c4389a98\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsUseAdminApprovalModeForAdministrators\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"c5031da4-494c-4c0e-afe7-2d5072dd9295\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsUseAdminApprovalMode\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"a5141a6e-ab14-43e8-847b-bf4ea3578f57\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"e7edecb9-6acd-4c6b-9647-fbac146d0d3c\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disableDriver\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideSmbV1ClientDriverStartConfiguration\",\r\n                           \"value\":  \"disableDriver\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"1420b80c-6577-4859-81ea-37bf3f1d113c\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideApplyUacRestrictionsToLocalAccountsOnNetworkLogon\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"82601919-99e1-4131-8fac-303f4a161847\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideStructuredExceptionHandlingOverwriteProtection\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"2a495a1c-3ac2-4a71-ada0-39166abbd79d\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideSmbV1Server\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"bed028f2-d036-4fba-a146-d6c1a86f4880\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_securityGuideWDigestAuthentication\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"4cfc49ae-3f34-4392-8f5c-f60a71c61930\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"highestProtection\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_networkIpV6SourceRoutingProtectionLevel\",\r\n                           \"value\":  \"highestProtection\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"b006bb55-d43c-4431-b46b-f23b022e4b15\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"highestProtection\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_networkIpSourceRoutingProtectionLevel\",\r\n                           \"value\":  \"highestProtection\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"853fbebc-4e8d-4259-9c8c-134afc76fbf4\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_networkIgnoreNetBiosNameReleaseRequestsExceptFromWinsServers\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"50fde74f-8e55-4dc3-9ab8-7d602df18497\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_networkIcmpRedirectsOverrideOspfGeneratedRoutes\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"a8e80f02-710d-4a08-98f9-ad0ca9802657\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_powerRequirePasswordOnWakeWhileOnBattery\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"e7b80d88-19f9-4ce4-ab4e-620bb6e7c627\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_powerRequirePasswordOnWakeWhilePluggedIn\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"5c296e38-64b1-4758-99b3-f4bb5067dbf1\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_powerStandbyStatesWhenSleepingWhileOnBattery\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"0c9aa3d0-dcf9-4b5e-9655-158ebdddda41\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_powerStandbyStatesWhenSleepingWhilePluggedIn\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"ab99ba80-2461-4c9f-82e3-235511a0738d\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"high\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesClientConnectionEncryptionLevel\",\r\n                           \"value\":  \"high\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"109829d1-e877-42f0-b318-2ce3a859c4ab\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesDriveRedirection\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"88570dda-6296-4955-a2c8-f3c2f62f2d67\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesPasswordSaving\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"c97993c5-7924-493d-b9e2-637e0b6eb51f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesPromptForPasswordUponConnection\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"fbe55480-c192-4dbc-936f-760ca56d0f4f\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_remoteDesktopServicesSecureRpcCommunication\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"2bc46ec1-9634-487b-8194-cab812ff310e\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientDigestAuthentication\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"1e2f653f-46f9-48c1-8a73-55907758d9d3\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceStoringRunAsCredentials\",\r\n                           \"value\":  \"enabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"cc886c65-f2d5-4153-9177-ecf3c6679f7a\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientBasicAuthentication\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"c4a5893c-2bab-4974-a7bb-53d87171ed30\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceBasicAuthentication\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"0fba5a11-6527-4f40-87e0-64aca1c10e28\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementClientUnencryptedTraffic\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"4436004e-fb82-449e-9d62-fcd14f62c9ac\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"disabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_remoteManagementServiceUnencryptedTraffic\",\r\n                           \"value\":  \"disabled\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"8a781fae-ba55-4e52-933c-654160ed80e3\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"authenticated\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_rpcUnauthenticatedClientOptions\",\r\n                           \"value\":  \"authenticated\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"cff92632-8e0c-42fa-8a37-b859d76b5def\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"goodUnknownAndBadButCritical\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_systemBootStartDriverInitialization\",\r\n                           \"value\":  \"goodUnknownAndBadButCritical\"\r\n                       },\r\n                       {\r\n                           \"id\":  \"fa5cf685-8ed3-4340-a6b3-2e15849f91b2\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_wiFiBlockAutomaticConnectHotspots\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"9c4b30ba-bf1c-425c-b7a3-cf15b7fd84c6\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementBooleanSettingInstance\",\r\n                           \"valueJson\":  \"true\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10GeneralConfiguration_internetSharingBlocked\",\r\n                           \"value\":  true\r\n                       },\r\n                       {\r\n                           \"id\":  \"3ef1559e-f0ae-46b2-8c2f-9263b9bda39e\",\r\n                           \"@odata.type\":  \"#microsoft.graph.deviceManagementStringSettingInstance\",\r\n                           \"valueJson\":  \"\\\"enabled\\\"\",\r\n                           \"definitionId\":  \"deviceConfiguration--windows10EndpointProtectionConfiguration_windowsConnectionManagerConnectionToNonDomainNetworks\",\r\n                           \"value\":  \"enabled\"\r\n                       }\r\n                   ],\r\n                   null,\r\n                   \"Windows 10 Security Baseline\"\r\n               ],\r\n    \"SyncRoot\":  {\r\n\r\n                 },\r\n    \"Count\":  4\r\n}",
                  "https://graph.microsoft.com/beta/deviceManagement/templates/034ccd46-190c-4afc-adf1-ad7cc11262eb/createInstance",
                  "Windows 10 Security Baseline",
                  [
                      "3613239c-8eed-49c6-8f4f-a9d3c2cca441"
                  ]
              ],
    "Count":  4
}